000_РОЗНИЦА_ЦЕНТР/src/Documents/ДоговорСтрахования/ДоговорСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорСтрахования</name>
  <registerRecords>AccumulationRegister.ТоварыЗастрахованные</registerRecords>
  <registerRecords>AccumulationRegister.ДоговорыСтрахованияОплаченные</registerRecords>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтраховогоВзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ДоговорСтрахования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокументы.Дата КАК Период,
	|	ТаблицаДокументы.Ссылка КАК Регистратор,
	|	ТаблицаДокументы.Ссылка КАК ДоговорСтрахования,
	|	ТаблицаДокументы.Номенклатура,
	|	ТаблицаДокументы.ДокументПродажи,
	|	1 КАК Количество,
	|	ТаблицаДокументы.СуммаСтраховогоВзноса КАК Сумма,
	|	ТаблицаДокументы.Магазин
	|ПОМЕСТИТЬ Источник
	|ИЗ
	|	Документ.ДоговорСтрахования КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Период КАК Период,
	|	ТаблицаДокументы.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокументы.Номенклатура,
	|	ТаблицаДокументы.ДокументПродажи,
	|	ТаблицаДокументы.Количество КАК Количество,
	|	ТаблицаДокументы.Магазин
	|ИЗ
	|	Источник КАК ТаблицаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Период КАК Период,
	|	ТаблицаДокументы.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокументы.Номенклатура,
	|	ТаблицаДокументы.ДоговорСтрахования,
	|	ТаблицаДокументы.Сумма КАК Сумма,
	|	ТаблицаДокументы.Магазин
	|ИЗ
	|	Источник КАК ТаблицаДокументы"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыЗастрахованные", Результаты[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДоговорыСтрахованияОплаченные", Результаты[2].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
